---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ConnectorProfileType
source: html/74f51f30-242d-3254-923e-e9ca26cf9cea.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ConnectorProfileType Property

"Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId ConnectorProfileType { get; }
```